In [15]:
#Esercizio Dal database AdventureWorks estraiamo la tabella dimproduct • Sulla colonna DealerPrice, utilizzando il metodo .round(), 
#arrotondiamo i valori alle due cifre decimali, e poi al valore intero più vicino • Utilizzando il metodo .clip(), facciamo in modo che i valori 
#siano compresi tra un minimo di 0 e un massimo di 1000

In [20]:
%run AdventureWorks.ipynb

Requirement already satisfied: pymysql in c:\users\maria\anaconda3\lib\site-packages (1.1.2)
Note: you may need to restart the kernel to use updated packages.
studente_dapt Ep1c0d3!!D4t4**4n4lys1s epicode-data-pt-mysql.cvetyjye2qbl.eu-central-1.rds.amazonaws.com AdventureWorksDW
mysql+pymysql://studente_dapt:Ep1c0d3!!D4t4**4n4lys1s@epicode-data-pt-mysql.cvetyjye2qbl.eu-central-1.rds.amazonaws.com/AdventureWorksDW

In [17]:
query = "SELECT * FROM dimproduct"
df= pd.read_sql(query, db_engine)
df

,ProductKey,ProductAlternateKey,ProductSubcategoryKey,WeightUnitMeasureCode,SizeUnitMeasureCode,EnglishProductName,SpanishProductName,FrenchProductName,StandardCost,FinishedGoodsFlag,...,ChineseDescription,ArabicDescription,HebrewDescription,ThaiDescription,GermanDescription,JapaneseDescription,TurkishDescription,StartDate,EndDate,Status
0,1,AR-5381,NaN,None,None,Adjustable Race,,,NaN,0,...,None,None,None,None,None,None,None,2003-07-01,NaT,Current
1,2,BA-8327,NaN,None,None,Bearing Ball,,,NaN,0,...,None,None,None,None,None,None,None,2003-07-01,NaT,Current
2,3,BE-2349,NaN,None,None,BB Ball Bearing,,,NaN,0,...,None,None,None,None,None,None,None,2003-07-01,NaT,Current
3,4,BE-2908,NaN,None,None,Headset Ball Bearings,,,NaN,0,...,None,None,None,None,None,None,None,2003-07-01,NaT,Current
4,5,BL-2036,NaN,None,None,Blade,,,NaN,0,...,None,None,None,None,None,None,None,2003-07-01,NaT,Current
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
601,602,BB-8107,5.0,G,None,ML Bottom Bracket,Eje de pedalier GM,Axe de pédalier ML,44.95,1,...,铝合金车圈；大直径脚蹬轴。,فناجين من سبيكة الألومنيوم؛ ذات محور دوران كبي...,כיסויים מסגסוגת אלומיניום; ציר רחב-קוטר.,ดุมอลูมิเนียมอัลลอยด์ แกนเพลาขนาดใหญ่,Außenringe aus Aluminiumlegierung; Radachse mi...,アルミニウム合金カップ、大径スピンドル。,Alüminyum alaşımı orta göbekler; geniş çaplı mil.,2013-07-01,NaT,Current
602,603,BB-9108,5.0,G,None,HL Bottom Bracket,Eje de pedalier GA,Axe de pédalier HL,53.94,1,...,铝合金车圈和空心轴。,فناجين من سبيكة الألومنيوم ومحور أجوف.,כיסויים מסגסוגת אלומיניום וציר חלול.,ดุมอลูมิเนียมอัลลอยด์และเพลากลวง,Außenringe aus Aluminiumlegierung und hohle Ac...,アルミニウム合金カップとホロー アクスル。,Alüminyum alaşımı orta göbekler ve içi boş aks.,2013-07-01,NaT,Current
603,604,BK-R19B-44,2.0,LB,CM,"Road-750 Black, 44","Carretera: 750, negra, 44","Vélo de route 750 noir, 44",343.65,1,...,入门级成人自行车；确保越野旅行或公路骑乘的舒适。快拆式车毂和轮缘。,إنها دراجة مناسبة للمبتدئين من البالغين؛ فهي ت...,"אופני מבוגרים למתחילים; מציעים רכיבה נוחה ""מחו...",จักรยานระดับเริ่มต้นสำหรับผู้ใหญ่ ให้ความสบายใ...,Ein Erwachsenenrad für Einsteiger; bietet Komf...,エントリー レベルに対応する、クロスカントリーにも街への買い物にも快適な、大人の自転車。ハブ...,"""Başlangıç seviyesinde yetişkin bisikleti, kır...",2013-07-01,NaT,Current
604,605,BK-R19B-48,2.0,LB,CM,"Road-750 Black, 48","Carretera: 750, negra, 48","Vélo de route 750 noir, 48",343.65,1,...,入门级成人自行车；确保越野旅行或公路骑乘的舒适。快拆式车毂和轮缘。,إنها دراجة مناسبة للمبتدئين من البالغين؛ فهي ت...,"אופני מבוגרים למתחילים; מציעים רכיבה נוחה ""מחו...",จักรยานระดับเริ่มต้นสำหรับผู้ใหญ่ ให้ความสบายใ...,Ein Erwachsenenrad für Einsteiger; bietet Komf...,エントリー レベルに対応する、クロスカントリーにも街への買い物にも快適な、大人の自転車。ハブ...,"""Başlangıç seviyesinde yetişkin bisikleti, kır...",2013-07-01,NaT,Current
605,606,BK-R19B-52,2.0,LB,CM,"Road-750 Black, 52","Carretera: 750, negra, 52","Vélo de route 750 noir, 52",343.65,1,...,入门级成人自行车；确保越野旅行或公路骑乘的舒适。快拆式车毂和轮缘。,إنها دراجة مناسبة للمبتدئين من البالغين؛ فهي ت...,"אופני מבוגרים למתחילים; מציעים רכיבה נוחה ""מחו...",จักรยานระดับเริ่มต้นสำหรับผู้ใหญ่ ให้ความสบายใ...,Ein Erwachsenenrad für Einsteiger; bietet Komf...,エントリー レベルに対応する、クロスカントリーにも街への買い物にも快適な、大人の自転車。ハブ...,"""Başlangıç seviyesinde yetişkin bisikleti, kır...",2013-07-01,NaT,Current

In [18]:
df.columns

Index(['ProductKey', 'ProductAlternateKey', 'ProductSubcategoryKey',
       'WeightUnitMeasureCode', 'SizeUnitMeasureCode', 'EnglishProductName',
       'SpanishProductName', 'FrenchProductName', 'StandardCost',
       'FinishedGoodsFlag', 'Color', 'SafetyStockLevel', 'ReorderPoint',
       'ListPrice', 'Size', 'SizeRange', 'Weight', 'DaysToManufacture',
       'ProductLine', 'DealerPrice', 'Class', 'Style', 'ModelName',
       'LargePhoto', 'EnglishDescription', 'FrenchDescription',
       'ChineseDescription', 'ArabicDescription', 'HebrewDescription',
       'ThaiDescription', 'GermanDescription', 'JapaneseDescription',
       'TurkishDescription', 'StartDate', 'EndDate', 'Status'],
      dtype='object')

In [21]:
#Sulla colonna DealerPrice, utilizzando il metodo .round(),arrotondiamo i valori alle due cifre decimali, e poi al valore intero più vicino
df["DealerPrice"].round(2)

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
601     60.74
602     72.89
603    323.99
604    323.99
605    323.99
Name: DealerPrice, Length: 606, dtype: float64

In [22]:
#e poi al valore intero più vicino
df["DealerPrice"].round()

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
       ...
601     61.0
602     73.0
603    324.0
604    324.0
605    324.0
Name: DealerPrice, Length: 606, dtype: float64

In [27]:
#Utilizzando il metodo .clip(), facciamo in modo che i valori siano compresi tra un minimo di 0 e un massimo di 1000
df["DealerPrice"] = df["DealerPrice"].clip(lower=0, upper=1000)
df["DealerPrice"]

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
        ...
601     60.744
602     72.894
603    323.994
604    323.994
605    323.994
Name: DealerPrice, Length: 606, dtype: float64

In [28]:
#Esercizio
#Creiamo un DataFrame sintetico, che contiene i guadagni mensili di diverse annate, con il seguente codice: years = 5 guadagni = pd.DataFrame
#({"Mese": list("GFMAMGLASOND"*years), "Anno": np.repeat(list(range(years)), 12), "Valore": np.random.randint(800, 5000, 12*years)}) 
#• Calcola la somma cumulativa dei guadagni utilizzando il metodo .cumsum() • Come sopra, ma raggruppato per ogni anno usando prima un .groupby()
import pandas as pd
import numpy as np
years = 5
guadagni = pd.DataFrame({"Mese": list("GFMAMGLASOND"*years),
                                   "Anno": np.repeat(list(range(years)), 12), 
                                   "Valore": np.random.randint(800, 5000, 12*years)
                        })
guadagni["guadagni_cum"] = guadagni["Valore"].cumsum()
print(guadagni)

   Mese  Anno  Valore  guadagni_cum
0     G     0     841           841
1     F     0    3592          4433
2     M     0    4435          8868
3     A     0    3340         12208
4     M     0    4812         17020
5     G     0    2414         19434
6     L     0    3078         22512
7     A     0    4026         26538
8     S     0    1382         27920
9     O     0    2606         30526
10    N     0    1921         32447
11    D     0    1458         33905
12    G     1    2139         36044
13    F     1    3002         39046
14    M     1    2277         41323
15    A     1    3861         45184
16    M     1    4475         49659
17    G     1    1900         51559
18    L     1    1949         53508
19    A     1    1499         55007
20    S     1    2649         57656
21    O     1    4401         62057
22    N     1    4401         66458
23    D     1    2077         68535
24    G     2    2533         71068
25    F     2    1545         72613
26    M     2    2607         75220
27    A     2    2289         77509
28    M     2    3908         81417
29    G     2    1036         82453
30    L     2    3831         86284
31    A     2    3622         89906
32    S     2    1865         91771
33    O     2    4322         96093
34    N     2    3966        100059
35    D     2    1617        101676
36    G     3    3900        105576
37    F     3    1926        107502
38    M     3    1257        108759
39    A     3    2345        111104
40    M     3    4357        115461
41    G     3    3529        118990
42    L     3    4518        123508
43    A     3    4202        127710
44    S     3    4903        132613
45    O     3    4113        136726
46    N     3    4847        141573
47    D     3    2086        143659
48    G     4    4159        147818
49    F     4    1411        149229
50    M     4    4975        154204
51    A     4    3731        157935
52    M     4    4150        162085
53    G     4    2713        164798
54    L     4    4806        169604
55    A     4    2434        172038
56    S     4     903        172941
57    O     4    4345        177286
58    N     4    3793        181079
59    D     4    4251        185330

In [30]:
#Come sopra, ma raggruppato per ogni anno usando prima un .groupby()
guadagni["cumulativo_anno"] = guadagni.groupby("Anno")["Valore"].cumsum()
print(guadagni)

   Mese  Anno  Valore  guadagni_cum  cumulativo_anno
0     G     0     841           841              841
1     F     0    3592          4433             4433
2     M     0    4435          8868             8868
3     A     0    3340         12208            12208
4     M     0    4812         17020            17020
5     G     0    2414         19434            19434
6     L     0    3078         22512            22512
7     A     0    4026         26538            26538
8     S     0    1382         27920            27920
9     O     0    2606         30526            30526
10    N     0    1921         32447            32447
11    D     0    1458         33905            33905
12    G     1    2139         36044             2139
13    F     1    3002         39046             5141
14    M     1    2277         41323             7418
15    A     1    3861         45184            11279
16    M     1    4475         49659            15754
17    G     1    1900         51559            17654
18    L     1    1949         53508            19603
19    A     1    1499         55007            21102
20    S     1    2649         57656            23751
21    O     1    4401         62057            28152
22    N     1    4401         66458            32553
23    D     1    2077         68535            34630
24    G     2    2533         71068             2533
25    F     2    1545         72613             4078
26    M     2    2607         75220             6685
27    A     2    2289         77509             8974
28    M     2    3908         81417            12882
29    G     2    1036         82453            13918
30    L     2    3831         86284            17749
31    A     2    3622         89906            21371
32    S     2    1865         91771            23236
33    O     2    4322         96093            27558
34    N     2    3966        100059            31524
35    D     2    1617        101676            33141
36    G     3    3900        105576             3900
37    F     3    1926        107502             5826
38    M     3    1257        108759             7083
39    A     3    2345        111104             9428
40    M     3    4357        115461            13785
41    G     3    3529        118990            17314
42    L     3    4518        123508            21832
43    A     3    4202        127710            26034
44    S     3    4903        132613            30937
45    O     3    4113        136726            35050
46    N     3    4847        141573            39897
47    D     3    2086        143659            41983
48    G     4    4159        147818             4159
49    F     4    1411        149229             5570
50    M     4    4975        154204            10545
51    A     4    3731        157935            14276
52    M     4    4150        162085            18426
53    G     4    2713        164798            21139
54    L     4    4806        169604            25945
55    A     4    2434        172038            28379
56    S     4     903        172941            29282
57    O     4    4345        177286            33627
58    N     4    3793        181079            37420
59    D     4    4251        185330            41671

In [33]:
%run AdventureWorks.ipynb

Requirement already satisfied: pymysql in c:\users\maria\anaconda3\lib\site-packages (1.1.2)
Note: you may need to restart the kernel to use updated packages.
studente_dapt Ep1c0d3!!D4t4**4n4lys1s epicode-data-pt-mysql.cvetyjye2qbl.eu-central-1.rds.amazonaws.com AdventureWorksDW
mysql+pymysql://studente_dapt:Ep1c0d3!!D4t4**4n4lys1s@epicode-data-pt-mysql.cvetyjye2qbl.eu-central-1.rds.amazonaws.com/AdventureWorksDW

In [34]:
#Esercizio 1/2
#Dal database AdventureWorks estraiamo la tabella dimcustomer • Trasformiamo i nomi dei clienti in modo che abbiano solo lettere minuscole, e i
#cognomi in modo che abbiano solo lettere maiuscole • Sulla colonna EmailAddress, utilizzando il metodo .str.split(), estraiamo nome utente e dominio 
#• Sulla colonna Phone, estraiamo ogni parte del numero (ad es. da "1 (11) 500 555-0162" a ["1", "(11)", "500", "555-0162"]) 
#• Utilizzando il metodo .str.contains(), estraiamo tutti gli indirizzi e-mail che contengono il numero "21"
#Esercizio 2/2 
#• Estraiamo tutti gli indirizzi e-mail che contengono il numero "20" oppure il numero "10" • Calcolare la lunghezza di ogni indirizzo e-mail ed
#estrarre i cinque più lunghi e i cinque più corti • Modificare il dominio degli indirizzi e-mail da "adventure-works.com" a "aw-db.com" mediante il
#metodo .str.replace() • Dalla colonna AddressLine1 estraiamo tutti gli indirizzi che contengono la sottostringa "Street"
import pandas as pd
import numpy as np
query = "SELECT * FROM dimcustomer"
df= pd.read_sql(query, db_engine)
df

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,...,EnglishOccupation,SpanishOccupation,FrenchOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance
0,11000,26,AW00011000,None,Jon,V,Yang,0,1971-10-06,M,...,Professional,Profesional,Cadre,1,0,3761 N. 14th St,None,1 (11) 500 555-0162,2011-01-19,1-2 Miles
1,11001,37,AW00011001,None,Eugene,L,Huang,0,1976-05-10,S,...,Professional,Profesional,Cadre,0,1,2243 W St.,None,1 (11) 500 555-0110,2011-01-15,0-1 Miles
2,11002,31,AW00011002,None,Ruben,None,Torres,0,1971-02-09,M,...,Professional,Profesional,Cadre,1,1,5844 Linden Land,None,1 (11) 500 555-0184,2011-01-07,2-5 Miles
3,11003,11,AW00011003,None,Christy,None,Zhu,0,1973-08-14,S,...,Professional,Profesional,Cadre,0,1,1825 Village Pl.,None,1 (11) 500 555-0162,2010-12-29,5-10 Miles
4,11004,19,AW00011004,None,Elizabeth,None,Johnson,0,1979-08-05,S,...,Professional,Profesional,Cadre,1,4,7553 Harness Circle,None,1 (11) 500 555-0131,2011-01-23,1-2 Miles
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18479,29479,209,AW00029479,None,Tommy,L,Tang,0,1969-06-30,M,...,Clerical,Administrativo,Employé,1,0,"111, rue Maillard",None,1 (11) 500 555-0136,2012-09-04,0-1 Miles
18480,29480,248,AW00029480,None,Nina,W,Raji,0,1977-05-06,S,...,Clerical,Administrativo,Employé,1,0,9 Katherine Drive,None,1 (11) 500 555-0146,2013-07-17,0-1 Miles
18481,29481,120,AW00029481,None,Ivan,None,Suri,0,1965-07-04,S,...,Clerical,Administrativo,Employé,0,0,Knaackstr 4,None,1 (11) 500 555-0144,2011-08-13,0-1 Miles
18482,29482,179,AW00029482,None,Clayton,None,Zhang,0,1964-09-01,M,...,Clerical,Administrativo,Employé,1,0,"1080, quai de Grenelle",None,1 (11) 500 555-0137,2012-09-18,0-1 Miles
18483,29483,217,AW00029483,None,Jésus,L,Navarro,0,1965-06-06,M,...,Clerical,Administrativo,Employé,1,0,"244, rue de la Centenaire",None,1 (11) 500 555-0141,2012-09-09,0-1 Miles

In [37]:
#Trasformiamo i nomi dei clienti in modo che abbiano solo lettere minuscole, e i cognomi in modo che abbiano solo lettere maiuscole
df["FirstName"] = df["FirstName"].str.lower()
df["LastName"] = df["LastName"].str.upper()
display(df)

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,FirstName,MiddleName,LastName,NameStyle,BirthDate,MaritalStatus,...,EnglishOccupation,SpanishOccupation,FrenchOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance
0,11000,26,AW00011000,None,jon,V,YANG,0,1971-10-06,M,...,Professional,Profesional,Cadre,1,0,3761 N. 14th St,None,1 (11) 500 555-0162,2011-01-19,1-2 Miles
1,11001,37,AW00011001,None,eugene,L,HUANG,0,1976-05-10,S,...,Professional,Profesional,Cadre,0,1,2243 W St.,None,1 (11) 500 555-0110,2011-01-15,0-1 Miles
2,11002,31,AW00011002,None,ruben,None,TORRES,0,1971-02-09,M,...,Professional,Profesional,Cadre,1,1,5844 Linden Land,None,1 (11) 500 555-0184,2011-01-07,2-5 Miles
3,11003,11,AW00011003,None,christy,None,ZHU,0,1973-08-14,S,...,Professional,Profesional,Cadre,0,1,1825 Village Pl.,None,1 (11) 500 555-0162,2010-12-29,5-10 Miles
4,11004,19,AW00011004,None,elizabeth,None,JOHNSON,0,1979-08-05,S,...,Professional,Profesional,Cadre,1,4,7553 Harness Circle,None,1 (11) 500 555-0131,2011-01-23,1-2 Miles
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18479,29479,209,AW00029479,None,tommy,L,TANG,0,1969-06-30,M,...,Clerical,Administrativo,Employé,1,0,"111, rue Maillard",None,1 (11) 500 555-0136,2012-09-04,0-1 Miles
18480,29480,248,AW00029480,None,nina,W,RAJI,0,1977-05-06,S,...,Clerical,Administrativo,Employé,1,0,9 Katherine Drive,None,1 (11) 500 555-0146,2013-07-17,0-1 Miles
18481,29481,120,AW00029481,None,ivan,None,SURI,0,1965-07-04,S,...,Clerical,Administrativo,Employé,0,0,Knaackstr 4,None,1 (11) 500 555-0144,2011-08-13,0-1 Miles
18482,29482,179,AW00029482,None,clayton,None,ZHANG,0,1964-09-01,M,...,Clerical,Administrativo,Employé,1,0,"1080, quai de Grenelle",None,1 (11) 500 555-0137,2012-09-18,0-1 Miles
18483,29483,217,AW00029483,None,jésus,L,NAVARRO,0,1965-06-06,M,...,Clerical,Administrativo,Employé,1,0,"244, rue de la Centenaire",None,1 (11) 500 555-0141,2012-09-09,0-1 Miles

In [38]:
df.columns

Index(['CustomerKey', 'GeographyKey', 'CustomerAlternateKey', 'Title',
       'FirstName', 'MiddleName', 'LastName', 'NameStyle', 'BirthDate',
       'MaritalStatus', 'Suffix', 'Gender', 'EmailAddress', 'YearlyIncome',
       'TotalChildren', 'NumberChildrenAtHome', 'EnglishEducation',
       'SpanishEducation', 'FrenchEducation', 'EnglishOccupation',
       'SpanishOccupation', 'FrenchOccupation', 'HouseOwnerFlag',
       'NumberCarsOwned', 'AddressLine1', 'AddressLine2', 'Phone',
       'DateFirstPurchase', 'CommuteDistance'],
      dtype='object')

In [39]:
df["EmailAddress"]

0             jon24@adventure-works.com
1          eugene10@adventure-works.com
2           ruben35@adventure-works.com
3         christy12@adventure-works.com
4        elizabeth5@adventure-works.com
                      ...
18479        tommy2@adventure-works.com
18480        nina21@adventure-works.com
18481         ivan0@adventure-works.com
18482      clayton0@adventure-works.com
18483        jésus9@adventure-works.com
Name: EmailAddress, Length: 18484, dtype: object

In [41]:
#Sulla colonna EmailAddress, utilizzando il metodo .str.split(), estraiamo nome utente e dominio 
df['EmailAddress_split'] = df['EmailAddress'].str.split('@')
print(df["EmailAddress_split"])

0             [jon24, adventure-works.com]
1          [eugene10, adventure-works.com]
2           [ruben35, adventure-works.com]
3         [christy12, adventure-works.com]
4        [elizabeth5, adventure-works.com]
                       ...
18479        [tommy2, adventure-works.com]
18480        [nina21, adventure-works.com]
18481         [ivan0, adventure-works.com]
18482      [clayton0, adventure-works.com]
18483        [jésus9, adventure-works.com]
Name: EmailAddress_split, Length: 18484, dtype: object

In [42]:
#Sulla colonna Phone, estraiamo ogni parte del numero (ad es. da "1 (11) 500 555-0162" a ["1", "(11)", "500", "555-0162"]) 
df["Phone"]

0        1 (11) 500 555-0162
1        1 (11) 500 555-0110
2        1 (11) 500 555-0184
3        1 (11) 500 555-0162
4        1 (11) 500 555-0131
                ...
18479    1 (11) 500 555-0136
18480    1 (11) 500 555-0146
18481    1 (11) 500 555-0144
18482    1 (11) 500 555-0137
18483    1 (11) 500 555-0141
Name: Phone, Length: 18484, dtype: object

In [43]:
df["Phone_split"] = df["Phone"].str.split(" ")
print(df["Phone_split"])

0        [1, (11), 500, 555-0162]
1        [1, (11), 500, 555-0110]
2        [1, (11), 500, 555-0184]
3        [1, (11), 500, 555-0162]
4        [1, (11), 500, 555-0131]
                   ...
18479    [1, (11), 500, 555-0136]
18480    [1, (11), 500, 555-0146]
18481    [1, (11), 500, 555-0144]
18482    [1, (11), 500, 555-0137]
18483    [1, (11), 500, 555-0141]
Name: Phone_split, Length: 18484, dtype: object

In [54]:
#Utilizzando il metodo .str.contains(), estraiamo tutti gli indirizzi e-mail che contengono il numero "21"
mask_21 = df["EmailAddress"].str.contains("21", regex=False)
df_21 = df[mask_21]
print(df[mask_21]["EmailAddress"])        #Ho filtrato la colonna EmailAddress per estrarre solo le email che contengono il numero "21".

64          chase21@adventure-works.com
118         alvin21@adventure-works.com
130      caroline21@adventure-works.com
163       gabriel21@adventure-works.com
203          luis21@adventure-works.com
                      ...
18337      hector21@adventure-works.com
18365      cheryl21@adventure-works.com
18435     stanley21@adventure-works.com
18440      rafael21@adventure-works.com
18480        nina21@adventure-works.com
Name: EmailAddress, Length: 431, dtype: object

In [53]:
#Estraiamo tutti gli indirizzi e-mail che contengono il numero "20" oppure il numero "10"
mask_20_10 = (df["EmailAddress"].str.contains("20", regex=False)) | (df["EmailAddress"].str.contains("10", regex=False))
df_20_10 = df[mask_20_10]
print(df_20_10["EmailAddress"])                      #Estraggo tutte le email che contengono il numero "20" oppure "10".

1            eugene10@adventure-works.com
10        jacquelyn20@adventure-works.com
22            ethan20@adventure-works.com
30          bethany10@adventure-works.com
32           denise10@adventure-works.com
                       ...
18395         lydia10@adventure-works.com
18397        walter10@adventure-works.com
18415         oscar20@adventure-works.com
18418       lindsey10@adventure-works.com
18428    kristopher20@adventure-works.com
Name: EmailAddress, Length: 1042, dtype: object

In [57]:
#Calcolare la lunghezza di ogni indirizzo e-mail ed estrarre i cinque più lunghi e i cinque più corti
df["EmailLength"] = df["EmailAddress"].str.len()
print(df[["EmailAddress", "EmailLength"]])           #Ho calcolato la lunghezza di ogni indirizzo e-mail e la visualizziamo insieme all'indirizzo.

                         EmailAddress  EmailLength
0           jon24@adventure-works.com           25
1        eugene10@adventure-works.com           28
2         ruben35@adventure-works.com           27
3       christy12@adventure-works.com           29
4      elizabeth5@adventure-works.com           30
...                               ...          ...
18479      tommy2@adventure-works.com           26
18480      nina21@adventure-works.com           26
18481       ivan0@adventure-works.com           25
18482    clayton0@adventure-works.com           28
18483      jésus9@adventure-works.com           26

[18484 rows x 2 columns]

In [58]:
#estrarre i cinque più lunghi e i cinque più corti
print(df.nlargest(5, "EmailLength")[["EmailAddress", "EmailLength"]])
print(df.nsmallest(5, "EmailLength")[["EmailAddress", "EmailLength"]])

                           EmailAddress  EmailLength
979   christopher25@adventure-works.com           33
1767  christopher18@adventure-works.com           33
2655  christopher23@adventure-works.com           33
3512  christopher27@adventure-works.com           33
4772  christopher10@adventure-works.com           33
                   EmailAddress  EmailLength
3974     k0@adventure-works.com           22
15299    y0@adventure-works.com           22
8      rob4@adventure-works.com           24
53     ana0@adventure-works.com           24
215    ana7@adventure-works.com           24

In [60]:
#Modificare il dominio degli indirizzi e-mail da "adventure-works.com" a "aw-db.com" mediante il metodo .str.replace()
df["EmailAddress"] = df["EmailAddress"].str.replace("adventure-works.com", "aw-db.com", regex=False)
print(df["EmailAddress"])
                                                #Sostituisco il dominio degli indirizzi e-mail da "adventure-works.com" a "aw-db.com" con .str.replace

0             jon24@aw-db.com
1          eugene10@aw-db.com
2           ruben35@aw-db.com
3         christy12@aw-db.com
4        elizabeth5@aw-db.com
                 ...
18479        tommy2@aw-db.com
18480        nina21@aw-db.com
18481         ivan0@aw-db.com
18482      clayton0@aw-db.com
18483        jésus9@aw-db.com
Name: EmailAddress, Length: 18484, dtype: object

In [62]:
df["AddressLine1"]

0                  3761 N. 14th St
1                       2243 W St.
2                 5844 Linden Land
3                 1825 Village Pl.
4              7553 Harness Circle
                   ...
18479            111, rue Maillard
18480            9 Katherine Drive
18481                  Knaackstr 4
18482       1080, quai de Grenelle
18483    244, rue de la Centenaire
Name: AddressLine1, Length: 18484, dtype: object

In [61]:
#Dalla colonna AddressLine1 estraiamo tutti gli indirizzi che contengono la sottostringa "Street"
mask= df["AddressLine1"].str.contains("Street", regex=False)
df_street = df[mask]
print(df[mask]["AddressLine1"])     #Ho estratto tutti gli indirizzi da AddressLine1 che contengono la parola "Street" facendo un filtro sulla colonna.

7              942 Brook Street
12            4785 Scott Street
32           626 Bentley Street
63           4927 Virgil Street
125          8481 Zartop Street
                  ...
18273        2155 Zartop Street
18292         3931 Scott Street
18323    134 Peachwillow Street
18333       1023 Hawkins Street
18351          8618 Rose Street
Name: AddressLine1, Length: 512, dtype: object

In [1]:
#Esercizio 1/2
#Dai beginner_datasets carichiamo in un DataFrame il file facebook.csv, che contiene dei post con data di pubblicazione, tipo (foto, video, …) e numero
#di reactions raccolte: • Con la funzione pd.to_datetime() convertiamo la colonna status_published in formato Timestamp • Utilizzando gli attributi .dt
#.year , .dt.month , .dt.day , .dt.dayofweek , .dt.dayofyear, ottieniamo informazioni specifiche sulle date delle transazioni, come l'anno, il mese, il
#giorno della settimana, il giorno dell'anno, eccetera
#Esercizio 2/2 
#• Estraiamo solo i post relativi al 2012 • Estraiamo solo i post relativi a maggio 2018 • Confrontiamo il numero di post pubblicati nei weekend
#rispetto al numero di post pubblicati nel resto della settimana • Troviamo il primo e ultimo post pubblicati in ogni anno • Quanti tipi di post ci
#sono? E quanti per ogni tipo?
import pandas as pd
df = pd.read_csv("facebook.csv")
df

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
0,246675545449582_1649696485147474,video,4/22/2018 6:00,529,512,262,432,92,3,1,1,0
1,246675545449582_1649426988507757,photo,4/21/2018 22:45,150,0,0,150,0,0,0,0,0
2,246675545449582_1648730588577397,video,4/21/2018 6:17,227,236,57,204,21,1,1,0,0
3,246675545449582_1648576705259452,photo,4/21/2018 2:29,111,0,0,111,0,0,0,0,0
4,246675545449582_1645700502213739,photo,4/18/2018 3:22,213,0,0,204,9,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
7045,1050855161656896_1061863470556065,photo,9/24/2016 2:58,89,0,0,89,0,0,0,0,0
7046,1050855161656896_1061334757275603,photo,9/23/2016 11:19,16,0,0,14,1,0,1,0,0
7047,1050855161656896_1060126464063099,photo,9/21/2016 23:03,2,0,0,1,1,0,0,0,0
7048,1050855161656896_1058663487542730,photo,9/20/2016 0:43,351,12,22,349,2,0,0,0,0
7049,1050855161656896_1050858841656528,photo,9/10/2016 10:30,17,0,0,17,0,0,0,0,0

In [2]:
df["status_published"]

0        4/22/2018 6:00
1       4/21/2018 22:45
2        4/21/2018 6:17
3        4/21/2018 2:29
4        4/18/2018 3:22
             ...
7045     9/24/2016 2:58
7046    9/23/2016 11:19
7047    9/21/2016 23:03
7048     9/20/2016 0:43
7049    9/10/2016 10:30
Name: status_published, Length: 7050, dtype: object

In [5]:
df["status_published"] = pd.to_datetime(df["status_published"])
print(df["status_published"])                #Converto la colonna status_published in formato Timestamp con pd.to_datetime.

0      2018-04-22 06:00:00
1      2018-04-21 22:45:00
2      2018-04-21 06:17:00
3      2018-04-21 02:29:00
4      2018-04-18 03:22:00
               ...
7045   2016-09-24 02:58:00
7046   2016-09-23 11:19:00
7047   2016-09-21 23:03:00
7048   2016-09-20 00:43:00
7049   2016-09-10 10:30:00
Name: status_published, Length: 7050, dtype: datetime64[ns]

In [7]:
df["year"] = df["status_published"].dt.year
print(df["year"])                                     #Estraggo l'anno dalla colonna status_published usando l'attributo .dt.year

0       2018
1       2018
2       2018
3       2018
4       2018
        ...
7045    2016
7046    2016
7047    2016
7048    2016
7049    2016
Name: year, Length: 7050, dtype: int32

In [8]:
df["month"] = df["status_published"].dt.month
print(df["month"])                                     #Estraggo il mese dalla colonna status_published usando l'attributo .dt.month

0       4
1       4
2       4
3       4
4       4
       ..
7045    9
7046    9
7047    9
7048    9
7049    9
Name: month, Length: 7050, dtype: int32

In [9]:
df["day"] = df["status_published"].dt.day
print(df["day"])                                     #Estraggo il giorno dalla colonna status_published usando l'attributo .dt.day

0       22
1       21
2       21
3       21
4       18
        ..
7045    24
7046    23
7047    21
7048    20
7049    10
Name: day, Length: 7050, dtype: int32

In [10]:
df["dayofweek"] = df["status_published"].dt.dayofweek
print(df["dayofweek"])                             #Estraggo il giorno della settimana dalla colonna status_published usando l'attributo .dt.dayofweek

0       6
1       5
2       5
3       5
4       2
       ..
7045    5
7046    4
7047    2
7048    1
7049    5
Name: dayofweek, Length: 7050, dtype: int32

In [11]:
df["dayofyear"] = df["status_published"].dt.dayofyear
print(df["dayofyear"])                             #Estraggo il giorno dell'anno dalla colonna status_published usando l'attributo .dt.dayofyear

0       112
1       111
2       111
3       111
4       108
       ...
7045    268
7046    267
7047    265
7048    264
7049    254
Name: dayofyear, Length: 7050, dtype: int32

In [13]:
post_2012 = df[df["year"] == 2012] 
display(post_2012)                           #Estraggo solo i post relativi al 2012

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys,year,month,day,dayofweek,dayofyear
2046,246675545449582_303160673134402,photo,2012-12-23 03:11:00,0,0,0,0,0,0,0,0,0,2012,12,23,6,358
2047,246675545449582_302341609882975,photo,2012-12-21 06:02:00,4,1,0,4,0,0,0,0,0,2012,12,21,4,356
2048,246675545449582_299212316862571,photo,2012-12-13 11:36:00,3,0,0,3,0,0,0,0,0,2012,12,13,3,348
2049,246675545449582_290159194434550,photo,2012-11-18 09:50:00,5,1,1,5,0,0,0,0,0,2012,11,18,6,323
2050,246675545449582_290154177768385,photo,2012-11-18 09:16:00,2,0,0,2,0,0,0,0,0,2012,11,18,6,323
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2630,246675545449582_246688625448274,photo,2012-07-15 03:54:00,19,17,3,19,0,0,0,0,0,2012,7,15,6,197
2631,246675545449582_246686478781822,photo,2012-07-15 03:42:00,12,3,0,12,0,0,0,0,0,2012,7,15,6,197
2632,246675545449582_246684432115360,photo,2012-07-15 03:32:00,14,1,0,14,0,0,0,0,0,2012,7,15,6,197
2633,246675545449582_246678538782616,photo,2012-07-15 02:58:00,14,7,0,14,0,0,0,0,0,2012,7,15,6,197
2634,246675545449582_246677465449390,photo,2012-07-15 02:51:00,15,3,0,15,0,0,0,0,0,2012,7,15,6,197

In [14]:
post_maggio_2018 = df[(df["year"] == 2018) & (df["month"] == 5)]
display(post_maggio_2018)                                # Estraiamo solo i post relativi a maggio 2018

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys,year,month,day,dayofweek,dayofyear
2690,134115277150304_264554297439734,photo,2018-05-31 12:17:00,11,0,0,10,0,1,0,0,0,2018,5,31,3,151
2691,134115277150304_264493694112461,photo,2018-05-31 08:37:00,56,4,2,55,1,0,0,0,0,2018,5,31,3,151
2692,134115277150304_264416247453539,photo,2018-05-31 03:12:00,72,13,1,69,3,0,0,0,0,2018,5,31,3,151
2693,134115277150304_264168277478336,photo,2018-05-30 08:46:00,10,0,0,10,0,0,0,0,0,2018,5,30,2,150
2694,134115277150304_264160757479088,photo,2018-05-30 08:24:00,56,3,12,54,2,0,0,0,0,2018,5,30,2,150
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6339,1050855161656896_1615666458509094,link,2018-05-04 01:27:00,12,7,7,12,0,0,0,0,0,2018,5,4,4,124
6340,1050855161656896_1614717551937318,photo,2018-05-03 01:15:00,63,21,1,62,1,0,0,0,0,2018,5,3,3,123
6341,1050855161656896_1614187798656960,photo,2018-05-02 12:17:00,218,105,153,212,2,4,0,0,0,2018,5,2,2,122
6342,1050855161656896_1613063202102753,video,2018-05-01 08:38:00,246,2373,475,108,130,5,2,1,0,2018,5,1,1,121
6343,1050855161656896_1612778858797854,photo,2018-05-01 01:18:00,34,5,0,33,1,0,0,0,0,2018,5,1,1,121

In [16]:
weekend_mask = df["dayofweek"].isin([5, 6])  # Maschera per i post nel weekend
num_weekend_post = df[weekend_mask].shape[0]  # Numero di post nel weekend
num_rest_post = df[~weekend_mask].shape[0]  # Numero di post nel resto della settimana

print("Numero di post nel weekend:", num_weekend_post)
print("Numero di post nel resto della settimana:", num_rest_post)

Numero di post nel weekend: 2041
Numero di post nel resto della settimana: 5009

In [17]:
primo_post = df.groupby("year")["status_published"].min()    #Primo post pubblicato in ogni anno
ultimo_post = df.groupby("year")["status_published"].max()   # Ultimo post pubblicato in ogni anno
print("Primo post per anno:\n", primo_post)
print("Ultimo post per anno:\n", ultimo_post)

Primo post per anno:
 year
2012   2012-07-15 02:51:00
2013   2013-01-02 02:23:00
2014   2014-01-05 09:23:00
2015   2015-01-02 03:41:00
2016   2016-01-03 04:23:00
2017   2017-01-02 08:25:00
2018   2018-01-01 01:39:00
Name: status_published, dtype: datetime64[ns]
Ultimo post per anno:
 year
2012   2012-12-23 03:11:00
2013   2013-12-31 23:38:00
2014   2014-12-10 07:42:00
2015   2015-12-31 08:20:00
2016   2016-12-31 05:13:00
2017   2017-12-31 22:15:00
2018   2018-06-13 01:12:00
Name: status_published, dtype: datetime64[ns]

In [19]:
num_tipi_post = df["status_type"].nunique()            #Quanti tipi di post ci sono? Uso .nunique()  che conta i valori unici nella colonna status_type
print("Numero di tipi di post:", num_tipi_post)

Numero di tipi di post: 4

In [20]:
conteggio_per_tipo = df["status_type"].value_counts()        #E quanti per ogni tipo? Uso .value_counts() perchè restituisce un conteggio di 
print(conteggio_per_tipo)                                     #ogni tipo di post

status_type
photo     4288
video     2334
status     365
link        63
Name: count, dtype: int64

In [21]:
#Esercizio
#Dai beginner_dataset carichiamo in un DataFrame il file pokemon.csv: • Tramite i metodi .isnull() e .sum() controlliamo se ci sono valori nulli nel 
#dataset e contiamo quanti valori nulli ci sono in ogni colonna • Ci sono valori nulli? • Se sì, avrebbe senso cercare di riempirli?
#• Eliminiamo le righe che contengono valori nulli
import pandas as pd 
df = pd.read_csv("pokemon.csv")
df

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [22]:
print(df.isnull().sum())                       # Controllo i valori nulli

#               0
Name            0
Type 1          0
Type 2        386
Total           0
HP              0
Attack          0
Defense         0
Sp. Atk         0
Sp. Def         0
Speed           0
Generation      0
Legendary       0
dtype: int64

In [26]:
df["Type 2"] = df["Type 2"].fillna(df["Type 1"])             # Sostituisco i valori nulli di Type 2 con il corrispondente valore di Type 1
display(df[["Type 1", "Type 2"]])

      Type 1  Type 2
0      Grass  Poison
1      Grass  Poison
2      Grass  Poison
3      Grass  Poison
4       Fire    Fire
..       ...     ...
795     Rock   Fairy
796     Rock   Fairy
797  Psychic   Ghost
798  Psychic    Dark
799     Fire   Water

[800 rows x 2 columns]

In [27]:
print(df["Type 2"].isnull().sum())               # Controllo che non ci siano più valori nulli

0

In [28]:
df = df.dropna()                                    # Elimino le righe che contengono ancora valori nulli
print(df.isnull().sum())                            # Controllo che non ci siano più valori nulli in nessuna colonna

#             0
Name          0
Type 1        0
Type 2        0
Total         0
HP            0
Attack        0
Defense       0
Sp. Atk       0
Sp. Def       0
Speed         0
Generation    0
Legendary     0
dtype: int64

In [2]:
#Esercizio
#Dai beginner_dataset carichiamo in un DataFrame il file automobile.csv: • Ci sono valori nulli? Dove? Quanti? 
#• Quali righe hanno un valore nullo nella colonna num-of-doors? • Esaminando i dati nel dataset, cerchiamo una logica per sostituire i valori 
#nulli nella colonna num-of-doors
import pandas as pd 
df = pd.read_csv("automobile.csv")
df

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164.0,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164.0,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
197,-1,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
198,-1,95.0,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95.0,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.4,23.0,106,4800,26,27,22470
200,-1,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625
201,-1,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [4]:
#Ci sono valori nulli? Dove? Quanti?
print(df.isna().sum())                          #Verifico i nulli con .isna()

symboling             0
normalized-losses    37
make                  0
fuel-type             0
aspiration            0
num-of-doors          2
body-style            0
drive-wheels          0
engine-location       0
wheel-base            0
length                0
width                 0
height                0
curb-weight           0
engine-type           0
num-of-cylinders      0
engine-size           0
fuel-system           0
bore                  0
stroke                0
compression-ratio     0
horsepower            0
peak-rpm              0
city-mpg              0
highway-mpg           0
price                 0
dtype: int64

In [6]:
#Quali righe hanno un valore nullo nella colonna num-of-doors?
df_null_doors = df[df["num-of-doors"].isna()]                  #Righe con valori nulli in num-of-doors
display(df_null_doors)

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
26,1,148.0,dodge,gas,turbo,NaN,sedan,fwd,front,93.7,...,98,mpfi,3.03,3.39,7.6,102,5500,24,30,8558
60,0,NaN,mazda,diesel,std,NaN,sedan,fwd,front,98.8,...,122,idi,3.39,3.39,22.7,64,4650,36,42,10795

In [7]:
#Esaminando i dati nel dataset, cerchiamo una logica per sostituire i valori nulli nella colonna num-of-doors
df["num-of-doors"].value_counts(dropna=False)

num-of-doors
four    114
two      86
NaN       2
Name: count, dtype: int64

In [14]:
filtro_mazda = df["make"] == "mazda"
df.loc[filtro_mazda, ["num-of-doors", "body-style"]].value_counts()

num-of-doors  body-style
two           hatchback     9
four          sedan         6
              hatchback     1
Name: count, dtype: int64

In [22]:
#Esercizio Abbiamo il seguente DataFrame che raccoglie le misurazioni di un sensore che misura la temperatura atmosferica giornaliera: import numpy as np, pandas as pd
#temp = pd.DataFrame({"Giorno": [0, 1, 2, 3, 4, 5, 6 7, 8, 9, 10, 11, 12], "Temperature": [18, 19, 18, np.nan, 21, 20, 20, np.nan, 21, 23, np.nan, 23, 24]})
#• Il sensore a volte non funziona, dunque alcuni dati sono mancanti: quale sarebbe la migliore strategia per gestirli? 
import numpy as np
import pandas as pd
temp = pd.DataFrame({"Giorno": [0, 1, 2, 3, 4, 5, 6 , 7, 8, 9, 10, 11, 12],
                     "Temperature": [18, 19, 18, np.nan, 21, 20, 20, np.nan, 21, 23, np.nan, 23, 24]
                    })
print(temp)

    Giorno  Temperature
0        0         18.0
1        1         19.0
2        2         18.0
3        3          NaN
4        4         21.0
5        5         20.0
6        6         20.0
7        7          NaN
8        8         21.0
9        9         23.0
10      10          NaN
11      11         23.0
12      12         24.0

In [24]:
temp.interpolate()                                 #Sostituisco i valori NaN con una stima ottenuta tramite interpolazione lineare

    Giorno  Temperature
0        0         18.0
1        1         19.0
2        2         18.0
3        3         19.5
4        4         21.0
5        5         20.0
6        6         20.0
7        7         20.5
8        8         21.0
9        9         23.0
10      10         23.0
11      11         23.0
12      12         24.0